{
  "id": "7-ghana-india-kofi-annan-centre-of-excellence-in-ict-bill",
  "title": "Ghana-India Kofi Annan Centre of Excellence in ICT Bill",
  "summary": "The Ghana-India Kofi Annan Centre of Excellence in ICT Bill establishes a centralized institution to coordinate ICT research, development, and training across Ghana's public sector. The Centre becomes **Ghana's designated national hub for ICT research and development**, with authority to manage international funding, provide training, and represent Ghana in global digital forums. The bill formalizes existing research centers in Bolgatanga and Sunyani under this new legal framework, ensuring operational continuity while creating a unified governance structure.\n\n**The bill introduces mandatory gatekeeping mechanisms that significantly impact public sector autonomy**. Public institutions must consult the Centre before seeking ICT training for employees or applying for research funding from international organizations. The Centre issues \"no objection\" certificates after evaluating project legitimacy, alignment with national goals, and institutional capacity. **Institutions that bypass consultation requirements or provide false information face financial penalties and potential exclusion from future funding opportunities**. While an appeals process exists through the Director-General and Minister, these requirements create additional approval layers that could delay critical ICT projects and innovation initiatives.\n\nThe governance structure concentrates significant authority in executive appointees. The President appoints all Board members (including representatives from academia, private sector, and civil society) and the Director-General, while the Minister can issue binding policy directives to the Board. The Centre controls access to international ICT funding for public institutions, evaluates all funding applications, and monitors project implementation. **This centralized control over funding and training creates potential bottlenecks in Ghana's digital transformation efforts**, particularly for institutions seeking to rapidly deploy ICT solutions or access specialized training without lengthy approval processes.\n\n**Digital Innovation & Business Environment**: The bill provides legal framework and potential coordination benefits for ICT research, but mandatory consultation requirements may slow innovation in public institutions. Private sector representatives serve on the Board, though the Centre's primary focus is public sector coordination. **Freedom of Speech & Privacy**: The bill does not directly address content regulation, surveillance, or data protection—its scope is limited to research, training, and funding coordination. **Accountability**: The Centre operates under standard public financial management requirements, including annual audits by the Auditor-General and parliamentary reporting, though the centralized approval authority raises concerns about bureaucratic efficiency and institutional autonomy in Ghana's public sector.",
  "pdfPath": "pdfs/7. Ghana-India Kofi Annan Centre of Excellence in ICT Bill.pdf",
  "impacts": {
    "innovation": {
      "score": "high-negative",
      "description": {
        "score": "high-negative",
        "analysis": "The Ghana-India Kofi Annan Centre of Excellence in ICT Bill creates significant obstacles to digital innovation in Ghana's public sector by establishing a mandatory gatekeeping system for all ICT research funding. Public institutions—including universities, research centers, and government agencies—must obtain \"no objection\" certificates from the Centre before applying for any local or international ICT research funding. This requirement introduces bureaucratic delays (minimum 30 days for Centre review, plus application preparation time) that are fundamentally incompatible with the fast-paced nature of digital innovation, where funding opportunities often have tight deadlines and competitive application processes. The requirement applies universally to all ICT research projects regardless of size, scope, or funding source, creating a centralized bottleneck that could stifle Ghana's ability to participate in emerging technology initiatives and international research collaborations.\n\nThe enforcement mechanisms compound the negative impact on innovation. Institutions that bypass the consultation requirement or provide incomplete information face fines up to 5,000 penalty units and potential disqualification from funding opportunities for up to three years. These severe penalties create a risk-averse environment that discourages experimentation and rapid prototyping—essential elements of digital innovation. The \"no objection\" certificates are project-specific and non-transferable, meaning institutions must repeat the approval process for each new initiative, multiplying administrative burden and delays. While the bill aims to ensure alignment with national ICT goals and prevent duplication, the mandatory pre-approval system removes institutional autonomy and flexibility that are critical for responding to rapidly evolving technology landscapes.\n\nThe bill does provide some potential benefits through coordination and the establishment of a legal framework for ICT research, and private sector representatives will serve on the governing Board. However, these modest advantages are substantially outweighed by the constraints on innovation velocity and institutional autonomy. Public institutions lose the ability to independently pursue emerging opportunities in artificial intelligence, blockchain, cybersecurity, and other fast-moving technology domains. The centralized control over funding access creates dependency on a single approval authority whose capacity, expertise, and responsiveness will determine the pace of digital innovation across Ghana's entire public sector. For a country seeking to accelerate digital transformation and compete in the global technology economy, this gatekeeping mechanism represents a significant structural impediment to innovation-driven growth."
      },
      "relatedProvisions": [
        "establishment-of-the-kofi-annan-research-and-development-centre",
        "functions-of-the-centre",
        "national-ict-research-and-development-mandate",
        "mandatory-consultation-for-ict-training",
        "intermediary-role",
        "no-objection-by-the-centre",
        "review-of-a-no-objection-decision-of-the-centre",
        "governing-body-of-the-centre",
        "establishment-of-centres-units-projects-and-limited-liability-entities",
        "tenure-of-office-of-members-of-the-board",
        "policy-directives",
        "regulations"
      ]
    },
    "business": {
      "score": "high-negative",
      "description": {
        "score": "high-negative",
        "analysis": "The Ghana-India Kofi Annan Centre of Excellence in ICT Bill creates substantial barriers to business activity in Ghana's ICT sector through its mandatory \"no objection\" requirement for public institutions seeking research and development funding. Any public institution—including universities, research centers, and government agencies—must obtain Centre approval before applying for ICT funding from any local or international source. This gatekeeping mechanism directly impacts the business environment by creating delays and uncertainty for public-private partnerships, university-industry collaborations, and technology transfer initiatives that depend on public sector participation. In Ghana's emerging digital economy, where speed and agility are competitive advantages, the requirement for an additional 30-day approval process (potentially longer if applications are rejected and resubmitted) could cause institutions to miss critical funding windows or partnership opportunities with private companies.\n\nThe severity of the impact is amplified by the Centre's broad discretionary authority and harsh penalties for non-compliance. The Centre evaluates whether projects are \"legitimate and aligned with national development goals in ICT\"—a vague standard that could be used to reject innovative or unconventional projects that don't fit predetermined government priorities. Institutions that provide incomplete information or misrepresent details face fines of 1,000-5,000 penalty units and potential three-year disqualification from funding applications. These penalties create a chilling effect that may discourage public institutions from pursuing experimental research or partnerships with startups and innovative private companies, particularly in emerging technology areas where project outcomes are uncertain and difficult to justify under rigid alignment criteria.\n\nWhile the bill includes some coordination benefits—such as reducing duplication and maintaining a repository of ICT projects—these modest advantages are outweighed by the friction introduced into Ghana's innovation ecosystem. The centralized approval system creates a bottleneck that could slow Ghana's digital transformation at a time when regional competitors are moving rapidly to attract ICT investment and talent. For businesses seeking to collaborate with Ghanaian public institutions on research, training, or technology deployment, the mandatory Centre approval adds complexity, uncertainty, and delay to partnership negotiations. The overall effect is to make Ghana's public sector a less attractive partner for private companies and international organizations seeking agile, responsive collaborators in the ICT space."
      },
      "relatedProvisions": [
        "establishment-of-the-kofi-annan-research-and-development-centre",
        "functions-of-the-centre",
        "national-ict-research-and-development-mandate",
        "mandatory-consultation-for-ict-training",
        "intermediary-role",
        "no-objection-by-the-centre",
        "review-of-a-no-objection-decision-of-the-centre",
        "governing-body-of-the-centre",
        "duties-and-liabilities-of-members-of-the-board",
        "tenure-of-office-of-members-of-the-board",
        "disclosure-of-interest",
        "policy-directives",
        "funds-of-the-centre",
        "regulations"
      ]
    }
  },
  "keyConcerns": [
    {
      "id": "criminal-penalties-for-undefined-research-standards",
      "title": "Criminal Penalties for Undefined Research Standards",
      "severity": "high",
      "description": "Public institutions must obtain Centre approval before applying for any ICT research funding, but approval criteria like \"legitimate\" research and \"alignment with national goals\" are undefined. Institutions face criminal fines and 3-year funding bans for providing information the Centre later deems misleading—yet cannot reliably predict what standards will be applied. This creates a chilling effect on public sector innovation while concentrating unchecked discretion in executive appointees with no independent oversight.",
      "relatedProvisions": [
        "no-objection-by-the-centre"
      ],
      "relatedImpacts": []
    }
  ],
  "provisions": [
    {
      "id": "establishment-of-the-kofi-annan-research-and-development-centre",
      "section": 1,
      "title": "Establishment of the Kofi Annan Research and Development Centre",
      "plainLanguage": "This provision creates the Kofi Annan Centre of Excellence in ICT, a legally recognized entity. The center will focus on research, development, and training in digital technologies and ICT, as well as provide expert advice. It has the power to acquire property and enter into contracts to achieve its goals.",
      "rawText": "- (1) There is established by this Act the Kofi Annan Centre of Excellence in ICT.\n\n        - The Centre shall be a body corporate with perpetual succession and a common seal, may sue and be sued in its corporate name.\n\n        - The Centre shall for the performance of its functions have the right to acquire and hold  movable  and  immovable  property  and  enter  into  a  contract  or  any  other transaction.\n\n        - Where  there  is  a  hindrance  to  the  acquisition  of  property,  the  property  may  be acquired for the Centre under the Land Act, 2020 (Act 1036) and the cost shall be borne by the Centre.\n\n## 2. Object of the Centre\n\nThe object of the  Centre is to serve as the  Centre of Excellence dedicated to advancing research, development, innovation, and capacity building, as well as providing consultancy and advisory services in emerging digital technologies and related fields in ICT.",
      "relatedImpacts": [
        "innovation",
        "business"
      ]
    },
    {
      "id": "functions-of-the-centre",
      "section": 2,
      "title": "Functions of the Centre",
      "plainLanguage": "The Centre is responsible for advancing ICT in Ghana through research, training, and collaboration with international organizations. It also represents Ghana in global digital forums and promotes digital inclusion across the country. Additionally, the Centre monitors ICT projects to ensure they align with national goals.",
      "rawText": "- 1) To achieve the object, the Centre shall:\n\n        - undertake research, development, training and consultancy in ICT;\n\n        - grant no objections to public institutions seeking to apply for public funding in ICT research, subject to fulfilment of application requirements;\n\n        - collaborate with international organisations on matters of research and development in  ICT and emerging digital technologies;\n\n        - provide education and training in ICT to public institutions;\n\n        - provide consultancy and advisory services in ICT to support public and private sector initiatives;\n\n        - represent  Ghana  in  regional  and  global  forums  and  foster  cross  border  digital  cooperation in ICT;\n\n        - promote digital inclusion and equitable access to infrastructure and services across Ghana through research, advocacy, training, capacity development, coaching and\n\n        - monitor and evaluate the impact of ICT projects and grant funded initiatives to ensure alignment with national goals in ICT; and\n\n        - perform any other functions ancillary to the objects of the Centre.\n\n## Powers of the Centre",
      "relatedImpacts": [
        "innovation",
        "business"
      ]
    },
    {
      "id": "national-ict-research-and-development-mandate",
      "section": 3,
      "title": "National ICT Research and Development Mandate",
      "plainLanguage": "This provision designates the Centre as Ghana's main hub for ICT research and development. The Centre will coordinate research efforts, manage funding for ICT projects, and support digital innovation in both the public and private sectors. This aims to boost technological advancement and innovation across the country.",
      "rawText": "- (1)  The  Centre  is  hereby  designated  as  the  National  Centre  for  Research  and Development in ICT, in Ghana.\n\n    - The Centre shall;\n\n          - serve  as  the  primary  institution  for  coordinating  research  and  development initiatives in ICT in the public sector;\n\n          - be the national institution for attracting and managing public funding and technical support in ICT research and development from bilateral and multilateral partners, philanthropic foundations, and other international bodies; and\n\n          - provide  support  to  public  and  private  sectors  engaged  in  digital  innovation  and research.",
      "relatedImpacts": [
        "innovation",
        "business"
      ]
    },
    {
      "id": "mandatory-consultation-for-ict-training",
      "section": 4,
      "title": "Mandatory Consultation for ICT Training",
      "plainLanguage": "This provision makes the Centre the primary provider of ICT training for government institutions. These institutions must consult with the Centre before seeking ICT training for their employees. If they don't consult or go against the Centre's recommendations, they could face penalties.",
      "rawText": "- (1) The Centre shall serve as the primary national body for the provision, coordination, and standardization of ICT training for public sector institutions in Ghana.\n\n    - All ministries, departments, agencies, metropolitan, municipal and district assemblies, statutory bodies, public corporations, and other state institutions intending to undertake ICT training for their personnel shall first consult the Centre regarding the availability and capacity to provide the required training.\n\n    - Where the Centre confirms that it has the capacity to deliver the requested training, the institution shall procure such training from the Centre.\n\n    - Where the Centre determines that it does not have the capacity to provide the training in whole or in part, the institution may procure such training from an alternative provider, subject to any guidance or standards issued by the Centre.\n\n    - Any institution, referred to under section 5(2) that procures ICT training without prior consultation  with  the  Centre,  or  contrary  to  the  Centre's  determination  under  this section,  shall  be  deemed  non-compliant  and  may  be  subject  to  administrative sanctions as may be prescribed by regulations.",
      "relatedImpacts": [
        "innovation",
        "business"
      ]
    },
    {
      "id": "intermediary-role",
      "section": 5,
      "title": "Intermediary Role",
      "plainLanguage": "The Centre will act as the main intermediary for managing funds from international organizations to support ICT research and development in Ghana's public institutions. It will evaluate project proposals, distribute funds, and monitor the progress of funded projects. This aims to make the funding process more efficient and ensure resources are used effectively.",
      "rawText": "- (1)  The  Centre shall serve as the national intermediary for public institutions in Ghana, responsible for receiving, assessing, coordinating, and disbursing public funding, grants, technical  assistance,  or  other  forms  of  support  from  international  and  philanthropic organizations intended to promote research, innovation, or development in ICT.\n\n    - Without limiting subsection (1), the Centre shall;\n\n          - establish  a  framework  for  the  submission  and  evaluation  of  public  funding proposals by public institutions;\n\n          - assess the technical, operational and financial feasibility of proposed projects of public institutions;\n\n          - act as an intermediary or fund administrator for funding to public institutions, where authorized by the funding partner; and\n\n          - monitor and report on the implementation and impact of projects financed through public funding.\n\n    - A  funding  agency, development  partner  or  international  donor  may  enter  into  an agreement with the Centre for the purposes of administering, disbursing or managing public funding in accordance with this section.",
      "relatedImpacts": [
        "innovation",
        "business"
      ]
    },
    {
      "id": "no-objection-by-the-centre",
      "section": 6,
      "title": "No Objection by the Centre",
      "plainLanguage": "Public institutions need to get approval from the Centre before applying for funding for ICT research. The Centre will assess if the project is legitimate, aligns with national goals, and if the institution has the capacity to carry it out. Institutions providing false information may face fines and be barred from applying for future funding.",
      "rawText": "- (1) A public institution who seeks to apply for, receive, administer or benefit from public funding from any local or international source for research or development project in ICT, shall, prior to applying for such funding, obtain a no objection from the Centre.\n\n    - The application shall be in writing and shall be accompanied by;\n\n              - such documents as shall be prescribed by regulations made pursuant to this Act; and\n\n              - prescribed fees.\n\n    - The Centre  shall keep  a  repository of public institutions  and research  and development projects certified under section 7 of this Act.\n\n    - The Centre shall issue a no objection where it is satisfied that;\n\n              - the proposed research and development project is legitimate and aligned with the national development goals in ICT;\n\n              - the public institution possesses the requisite capacity to execute the proposed research and development project; and\n\n              - the  implementation and governance framework of the proposed research and development project meets the standards prescribed by the Centre.\n\n    - A no objection granted under this section;\n\n              - shall be valid only for the specific the proposed research and development project for which it is issued;\n\n              - shall not be transferrable;\n\n              - shall  not  constitute  a  general  endorsement  of  the  public  institution's  other activities; and\n\n              - may be subject to such conditions as the Centre may prescribe.\n\n              - knowingly misrepresents or omits material information in an application for no objection commits an offence and is liable on summary conviction to a fine of not less than one thousand penalty units and not more than five thousand penalty units.\n\n    - In addition to any penalty imposed under subsection (6) the Centre may disqualify the public institution from applying for a no objection or public funding for a period not exceeding three (3) years.\n\n    - The Centre shall, within thirty (30) days of receipt of an application for no objection inform the public institution in writing of the decision of the Centre.",
      "relatedImpacts": [
        "innovation",
        "business"
      ]
    },
    {
      "id": "review-of-a-no-objection-decision-of-the-centre",
      "section": 7,
      "title": "Review of a no objection decision of the Centre",
      "plainLanguage": "If a public institution's application is denied, they can appeal the decision. The appeal process involves a review by the Director-General, and if still dissatisfied, a further review by the Minister. The provision sets deadlines for each stage of the review process.",
      "rawText": "- (1) A public institution whose no objection application has been denied by the Centre may, within thirty 30 days of receipt of the decision, submit a complaint in writing to the Director-General for a review of the decision. The Director-General shall within thirty (30) days of receipt of the complaint, review the complaint and inform the complainant of the outcome of the review.\n\n(2)  A  public  institution  dissatisfied  with  the  decision  of  the  Director-General  under subsection (1) may, within 28 days after the date of receipt of the decision, submit a complaint in writing to the Minister for a review of the decision of the Director-General. The Minister shall within 60 days of receipt of the complaint, review the complaint and inform the complainant of a decision.\n\n## Governance of the Centre",
      "relatedImpacts": [
        "innovation",
        "business"
      ]
    },
    {
      "id": "governing-body-of-the-centre",
      "section": 8,
      "title": "Governing Body of the Centre",
      "plainLanguage": "This provision establishes the structure of the Centre's Governing Board, specifying the required representatives from various sectors and ensuring gender diversity. The President appoints the board members. This ensures a broad range of expertise and perspectives in the Centre's governance.",
      "rawText": "- (1)  The governing body of the Centre shall be a Governing Board consisting of;\n\n          - The Chairperson;\n\n          - The Director-General of the Centre;\n\n          - One representative from the Technical, Vocational Education and Training (TVET) Service, not below the rank of a Director;\n\n          - One representative from the Ministry not below the rank of a Director;\n\n          - Two persons in academia appointed by the Ghana Tertiary Education Commission, with expertise in ICT, not below the rank of Senior Lecturer;\n\n          - Two persons with expertise in ICT, nominated by their professional bodies; and\n\n          - Two persons appointed by the President.\n\n    - Members of the Board shall be appointed by the President in accordance with Article 70 of the Constitution.\n\n    - Notwithstanding any other provision in this section, the composition of the governing board shall include not less than three (3) women as members.",
      "relatedImpacts": [
        "innovation",
        "business"
      ]
    },
    {
      "id": "functions-of-the-board",
      "section": 9,
      "title": "Functions of the Board",
      "plainLanguage": "The Board is responsible for managing the Centre, creating policies, and ensuring it meets its goals. This includes setting up effective structures, reviewing reports, advising the Minister on relevant laws and regulations, and performing other tasks to support the Centre's mission. Ultimately, the Board is in charge of the Centre's overall success.",
      "rawText": "- (1) The Board shall be responsible for the performance of the functions of the Centre, the drafting and implementing of operational policies, general supervision of the management and affairs of the Centre; and such other functions conferred upon it by this Act.\n\n    - For the purposes of subsection (1);\n\n          - establish  appropriate  structures  for  the  effective  and  efficient  execution  of  the object of the  Centre;\n\n          - secure the achievement of the object of the Centre;\n\n          - take reasonable and timely action on the reports submitted to it by the DirectorGeneral;\n\n          - advise  the  Minister  on the drafting of  legislative  instruments,  regulations and policies  for  the  effective  implementation of this Act; and\n\n          - perform any other functions incidental to the achievement of the aims of the Centre.",
      "relatedImpacts": []
    },
    {
      "id": "duties-and-liabilities-of-members-of-the-board",
      "section": 10,
      "title": "Duties and Liabilities of members of the Board",
      "plainLanguage": "Board members must act responsibly and honestly, similar to company directors. They are prohibited from using their position for personal gain or causing harm to the Centre. Violations of these duties can lead to significant fines.",
      "rawText": "- (1) A member of the Board shall have the same fiduciary relationship with the Centre and the duty to act in good faith as a director of a company incorporated under the Companies Act, 2019 (Act 992).\n\n        - Without limiting subsection (1), a member of the Board has a duty;\n\n          - to act honestly in the performance of the functions of that member;\n\n          - to exercise the degree of care and diligence in the performance of the functions of that  member,  that  a  reasonable  person  in  that  position  would  reasonably  be expected to exercise in the circumstances;\n\n          - not  to  use  information  acquired  by  virtue  of  the  position  of  that  member  as  a member of the Board without authorization; and\n\n          - not to use the position of the member to gain directly or indirectly, a benefit for that member or for any other person; and\n\n          - not to knowingly or negligently cause loss to the Centre.\n\n      - A member of the Board who contravenes subsection (1) or (2) commits an offence and is liable on summary conviction to a fine of not less than two thousand penalty units and not more than six thousand penalty units.",
      "relatedImpacts": [
        "business"
      ]
    },
    {
      "id": "establishment-of-centres-units-projects-and-limited-liability-entities",
      "section": 11,
      "title": "Establishment of centres, units, projects and  limited liability entities",
      "plainLanguage": "This provision allows the Board to establish different types of entities to effectively carry out the Centre's objectives. It also ensures that existing centers, such as the Open Technologies Research and Development Centre in Bolgatanga and the Smart Technologies & AI Research Centre in Sunyani, will continue to operate under the new law. This ensures continuity and provides the Board with the flexibility to create new structures as needed.",
      "rawText": "- (1) The Board shall have the power to establish centres, units, projects and limited liability entities with appropriate structures for the effective and efficient execution of the object of the Centre.\n\n    - Without  limiting  subsection  (1),  the  following  centres  established  prior  to  the commencement of this Act shall continue to operate under this Act as centres of the Centre;\n\n          - Open Technologies Research and Development Centre, Bolgatanga;\n\n          - Smart Technologies & AI Research Centre, Sunyani; and",
      "relatedImpacts": [
        "innovation"
      ]
    },
    {
      "id": "meetings-of-the-board",
      "section": 12,
      "title": "Meetings of the Board",
      "plainLanguage": "The Board must meet at least quarterly, and can hold additional meetings if requested by a third of its members. Decisions are made by a majority vote of attending members, with the chairperson having a tie-breaking vote. The Board can also invite people to attend meetings who don't have voting rights and can set its own meeting procedures.",
      "rawText": "- (1) The Board shall meet at least once every three months for the dispatch of business at a time and venue determined by the chairperson.\n\n    - The  chairperson  shall  at  the  request  in  writing  of  not  less  than  one  third  of  the membership of the Board convene an extra-ordinary meeting of the Board at a place and time determined by the chairperson.\n\n    - The quorum at a meeting of the Board is two thirds of members of the Board or a greater number determined by the Board in respect of an important matter.\n\n    - The chairperson shall preside at the meetings of the Board and in the absence of the chairperson, a  member of the Board elected by the members present from among their number shall preside.\n\n    - Matters before the Board shall be decided by a majority of the members present and voting, and in  the event  of  an equality  of  votes,  the  person  presiding  shall  have  a casting vote.\n\n    - The Board may co-opt a person to attend a Board meeting but that person shall not vote on a matter for decision at the meeting.\n\n    - The proceedings of the Board shall not be invalidated due to a vacancy among the members or a defect in the appointment or qualification of a member.\n\n    - The Board shall, subject to this section, determine the procedure for its meetings.",
      "relatedImpacts": []
    },
    {
      "id": "tenure-of-office-of-members-of-the-board",
      "section": 13,
      "title": "Tenure of office of members of the Board",
      "plainLanguage": "Board members can serve up to two four-year terms. Members can resign, be removed for missing three consecutive meetings, or have their appointment revoked by the President. Vacancies are filled by presidential appointment.",
      "rawText": "- ( 1) A member of the Board shall hold office for a period not exceeding four years and is eligible for re- appointment, but a member shall not be appointed for more than two terms.\n\n    - Subsection (1) does not apply to the Director-General of the Centre.\n\n    - A member of the Board may at any time resign from office in writing addressed to the President through the Minister.\n\n    - A member  of  the  Board,  other  than  the  Director-General  of  the  Centre,  who  is absent  from  three consecutive meetings of the Board without sufficient cause shall cease to be a member of the Board.\n\n    - The President may by letter addressed to a member revoke the appointment of that member.\n\n    - Where a member of the Board is, for a sufficient cause, unable to act as a member, the  Minister shall determine whether the inability would result in the declaration of a vacancy.\n\n    - Where there is a vacancy; under subsection (3), or subsection (4), or as a result of a declaration under subsection (6), or by reason of the death of a member, the Minister shall notify the President of the vacancy and the President shall appoint a person to fill the vacancy.",
      "relatedImpacts": [
        "innovation",
        "business"
      ]
    },
    {
      "id": "disclosure-of-interest",
      "section": 14,
      "title": "Disclosure of Interest",
      "plainLanguage": "This provision requires board members to disclose any conflicts of interest they may have regarding matters before the board. If a member fails to disclose an interest and participates in the discussion, they will be removed from the board. This ensures transparency and prevents biased decision-making.",
      "rawText": "- (1) A member of the Board who has an interest in a matter for consideration by the Board shall:\n\n          - disclose, in writing, the nature of the interest to the Board prior to or at the meeting at which the matter is to be considered; and the disclosure shall form part of the record for the consideration of the matter; and\n\n          - not be present at nor participate in the deliberations of the Board in respect of that matter.\n\n      - A member ceases to be a member of the Board, if that member has an interest in a matter before the Board but;\n\n          - fails to disclose that interest, and\n\n          - is present and participates in the deliberations of the matter.",
      "relatedImpacts": [
        "business"
      ]
    },
    {
      "id": "committees-of-the-board",
      "section": 15,
      "title": "Committees of the Board",
      "plainLanguage": "The Board can form committees with Board members and/or outside individuals to handle specific tasks. Members of these committees serve as long as their term on the board lasts, and a board member must chair any committee that includes non-board members. All committee members must disclose any potential conflicts of interest.",
      "rawText": "- (1)  The Board may establish committees consisting of members of the Board or nonmembers of the Board or both  and may assign to these committees such functions as the Board may determine.\n\n      - The  tenure  of  office  of  a  member  of  a  committee  shall  be  coterminous  with  that member's term of office on the Board.\n\n      - A committee composed of members and non-members of the Board shall be chaired by a member of the Board.\n\n      - The provisions of Section 16 on Disclosure of Interest shall apply to members of a committee of the Board.",
      "relatedImpacts": []
    },
    {
      "id": "allowances-for-members-of-the-board-and-committees",
      "section": 16,
      "title": "Allowances for members of the Board and Committees",
      "plainLanguage": "This provision states that members of the Board and its committees will receive allowances. The amount of these allowances must be approved by the Minister and the Minister of Finance. This ensures that board members are compensated appropriately, with oversight from relevant government officials.",
      "rawText": "- Board members and members of committees of the Board shall be paid such allowances as are approved by the Minister in consultation with the Minister responsible for Finance.",
      "relatedImpacts": []
    },
    {
      "id": "policy-directives",
      "section": 17,
      "title": "Policy Directives",
      "plainLanguage": "The Minister can provide written instructions, called policy directives, to the Board. These directives must be in line with the law, and the Board is required to follow them. This allows the Minister to guide the Board's actions.",
      "rawText": "- The  Minister  may  give  policy  directives  to  the  Board  in  writing,  consistent  with  the provisions of this Act and the Board shall comply.\n\n## Administration of the Centre",
      "relatedImpacts": [
        "innovation",
        "business"
      ]
    },
    {
      "id": "director-general-of-the-centre",
      "section": 18,
      "title": "Director- General of the Centre",
      "plainLanguage": "The President appoints the Director-General, who manages the Centre according to the Board's guidelines. They can delegate tasks but remain responsible, and must have high moral character and relevant experience. The specifics of their employment are detailed in their appointment letter.",
      "rawText": "- (1) The  Director-General  shall  be  appointed  by  the  President  in  accordance  with Article  195  of  the Constitution.\n\n    - The  Director-General  shall,  subject  to  the  general  directives  of  the  Board,  be responsible  for  the effective management and administration of the Centre.\n\n    - The  Director-General  shall  hold  office  on  the  terms  and  conditions  specified  in his/her  letter  of appointment.\n\n    - The Director-General may in writing, delegate a function to an officer of the Centre, except that,  such delegation  shall not  relieve  the  Director-General  of  the  ultimate responsibility for the performance of the delegated function.\n\n    - The  Director-General  shall  be  a  person  of  high  moral  character  and  integrity  with the  relevant qualifications and experience related to the functions of the Centre.",
      "relatedImpacts": []
    },
    {
      "id": "secretary-to-the-board",
      "section": 19,
      "title": "Secretary to the Board",
      "plainLanguage": "This provision establishes the position of Secretary to the Board, who must be a Deputy Director or higher. The Secretary is responsible for organizing meetings, keeping records, and managing members' interests. The Secretary reports directly to the Board.",
      "rawText": "- (1) The Board shall designate an officer of the Centre not below the rank of a Deputy Director as Secretary to the Board.\n\n    - The Secretary shall;\n\n            - arrange the meetings of the Board;\n\n            - record and maintain minutes of meetings of the Board;\n\n            - record and maintain resolutions passed by the Board;\n\n            - maintain a Register of Board Members' Interest; and\n\n            - perform any other functions assigned by the Board.\n\n    - The  Secretary,  in  the  performance  of  the  functions  under  subsection  (2),  shall be accountable to the Board.",
      "relatedImpacts": []
    },
    {
      "id": "appointment-of-other-staff",
      "section": 20,
      "title": "Appointment of other Staff",
      "plainLanguage": "The Centre is authorized to hire necessary staff, consultants, and experts, with the Board setting qualifications and employment terms. Public officers can also be transferred to the Centre to provide assistance. This ensures the Centre has the resources and expertise needed to function effectively.",
      "rawText": "- (1) The Centre may employ such staff as may be necessary for the proper and effective performance of its functions.\n\n    - The  Board  shall  determine  vacancies and  qualifications  of  staff  to  be  recruited  in accordance with Article  195 of the Constitution.\n\n    - The terms, conditions and scheme of service of a person employed by the  Centre shall be as approved by the Board.\n\n    - The  Centre  may,  on  the  recommendation  of  the  Board,  engage  the  services  of consultants and experts for the effective discharge  of the functions of the Centre.\n\n    - Other public officers may be transferred or seconded to the Centre or may otherwise provide assistance to the Centre.",
      "relatedImpacts": []
    },
    {
      "id": "directorates-of-the-centre",
      "section": 21,
      "title": "Directorates of the Centre",
      "plainLanguage": "The Board has the power to create directorates within the Centre to ensure it runs efficiently. These directorates may include departments focused on research, studies, corporate affairs, consultancy, and finance. This allows the Centre to organize its functions effectively.",
      "rawText": "- (1) The Board may create such directorates as it may consider necessary for the efficient and effective  performance of the functions of the Centre.\n\n    - The directorates may include:\n\n              - research and innovation;\n\n              - studies;\n\n              - corporate affairs and media relations;\n\n              - consultancy; and\n\n              - finance and administration.\n\nFinancial Provisions",
      "relatedImpacts": []
    },
    {
      "id": "internal-audit",
      "section": 22,
      "title": "Internal Audit",
      "plainLanguage": "This provision establishes an internal audit unit within the Centre, as required by the Public Financial Management Act. This unit will be responsible for ensuring financial accountability and proper management of resources. It helps to maintain transparency and prevent misuse of funds.",
      "rawText": "- The Centre shall have an internal audit unit in accordance with section 83 of the Public Financial Management Act, 2016 (Act 921).",
      "relatedImpacts": []
    },
    {
      "id": "funds-of-the-centre",
      "section": 23,
      "title": "Funds of the Centre",
      "plainLanguage": "This provision specifies how the Centre will be funded. The Centre's funds will come from parliamentary allocations, fees, penalties, internally generated funds, grants, donations, loans, and other funds approved by the Minister responsible for Finance. These funds will allow the Centre to operate and achieve its objectives.",
      "rawText": "- (1) The funds of the Centre shall include:\n\n        - moneys approved by Parliament for the Centre;\n\n        - application fees;\n\n        - administrative penalties;\n\n        - any other internally generated funds;\n\n        - grants, donations and loans approved by the Minister responsible for Finance; and\n\n        - any other moneys approved by the Minister responsible for Finance.",
      "relatedImpacts": [
        "business"
      ]
    },
    {
      "id": "budget-estimates",
      "section": 24,
      "title": "Budget Estimates",
      "plainLanguage": "The Director-General must create a budget each year and present it to the Board. The Board must approve the budget at least four months before the end of the current financial year. This ensures the organization has a financial plan in place before each new year.",
      "rawText": "- The Director-General shall prepare budget estimates for each financial year and present the estimates to the Board for its approval not later than four months prior to the end of the financial year.",
      "relatedImpacts": []
    },
    {
      "id": "bank-account-of-the-centre",
      "section": 25,
      "title": "Bank Account of the Centre",
      "plainLanguage": "The Centre is required to open a bank account specifically for its funds. The Controller and Accountant-General must approve this bank account. This ensures proper oversight of the Centre's finances.",
      "rawText": "- The moneys for the Centre shall be paid into a bank account opened for the purpose, by the Centre with the approval of the Controller and Accountant-General.",
      "relatedImpacts": []
    },
    {
      "id": "borrowing-powers-of-the-centre",
      "section": 26,
      "title": "Borrowing powers of the Centre",
      "plainLanguage": "This provision allows the Centre to borrow money from approved banks or financial institutions, provided the government guarantees the loan. The Minister of Finance must also approve the financial institution. This borrowing is also subject to existing financial regulations.",
      "rawText": "- Subject to section 76 of the Public Financial Management Act, 2016, (Act 921), the Centre may obtain loans and any other credit facilities on the guarantee of the Government from a bank or any other financial institution approved by the Minister responsible for Finance.",
      "relatedImpacts": []
    },
    {
      "id": "expenses-of-the-centre",
      "section": 27,
      "title": "Expenses of the Centre",
      "plainLanguage": "The Centre will pay for its own expenses using its own funds. This means the Centre is financially responsible for its operations and must use its resources to cover its costs.",
      "rawText": "- The expenses of the Centre shall be charged on the funds of the Centre.",
      "relatedImpacts": []
    },
    {
      "id": "accounts-and-audit",
      "section": 28,
      "title": "Accounts and Audit",
      "plainLanguage": "The Board must keep financial records and submit them to the Auditor-General for an annual audit. The Auditor-General will then provide an audit report to the Minister and the Board. The Centre's financial year will align with the government's financial year.",
      "rawText": "- (1) The Board shall keep books, records, returns and other documents relevant to the accounts in the form approved by the Auditor-General.\n\n    - The Board shall submit the accounts of the Centre to the Auditor-General for audit at the end of each financial year.\n\n    - The  Auditor-General  shall  within  six  months  after  the  end  of  the  immediately preceding financial year, audit the accounts and forward a copy of the audit report to the Minister and the Board.\n\n    - The  financial  year  of  the  Centre  shall  be  the  same  as  the  financial  year  of  the Government.",
      "relatedImpacts": []
    },
    {
      "id": "annual-report-and-other-reports",
      "section": 29,
      "title": "Annual Report and other Reports",
      "plainLanguage": "The Board must create an annual report about the Centre's activities and give it to the Minister along with the audit report. The Minister then passes this report on to Parliament. The Board must also provide other reports if the Minister asks for them.",
      "rawText": "- (1) The Board shall within one month after the receipt of the audit report, submit an annual report to the Minister covering the activities and the operations of the Centre for the year to which the report relates.\n\n    - The annual report shall include the report of the Auditor-General.\n\n    - The Minister shall, within one month after the receipt of the annual report, submit the report  to  Parliament  with  a  statement  that  the  Minister  considers  necessary.  The Board shall submit to the Minister any other reports which the Minister may require in writing.\n\n## Miscellaneous Provisions",
      "relatedImpacts": []
    },
    {
      "id": "regulations",
      "section": 30,
      "title": "Regulations",
      "plainLanguage": "This section allows the Minister to create regulations with the Centre's guidance to support the law. These regulations will address practical aspects like application forms, product certifications, resolving disputes, and adjusting penalties. This ensures the law can be effectively implemented and adapted as needed.",
      "rawText": "- (1)  The  Minister  on  the  advice  of  the  Centre  may  by  legislative  instrument  make regulations to provide for;\n\n          - forms and supporting documents for applications;\n\n          - authorizations;\n\n          - certification  of  ICT  products  and  technology  solutions  intended  for  research  and development purposes;\n\n          - dispute resolution;\n\n          - amendment of the penalties specified in Section 7; and\n\n          - any other matter necessary for the effective implementation of the provisions of this Act.",
      "relatedImpacts": [
        "innovation",
        "business"
      ]
    },
    {
      "id": "transitional-provisions",
      "section": 31,
      "title": "Transitional provisions",
      "plainLanguage": "This section ensures a smooth transition by automatically transferring existing employees, contracts, and assets to the newly established Centre. It also designates existing centers and units as part of the new Centre, maintaining operational continuity. This prevents any disruption in the Centre's activities due to the change in legal structure.",
      "rawText": "- (1) A person in the employment of the Centre immediately before the coming into force of  this  Act  shall,  on  the coming into force of this Act, be deemed to have been duly employed by the Centre established under this Act on terms and conditions which are not\n\n    - A  contract  subsisting  between  the  Centre  and  any  other  person  and  in  force immediately before the coming into force of this Act shall subsist between the Centre established under this Act and that other person.\n\n    - Any moneys and properties held by or on behalf of the Centre immediately before the coming into force of this Act are transferred to the Centre established under this Act.\n\n    - With effect from the coming into force of this Act, the centres, units and the limited liability entities as specified in section 12(2) are centres, units, projects and limited liability entities of the Centre established under this Act.",
      "relatedImpacts": []
    },
    {
      "id": "interpretation",
      "section": 32,
      "title": "Interpretation",
      "plainLanguage": "This section defines key terms used in the Act to ensure clarity and consistent interpretation. Some of the key definitions include \"Board,\" \"Centre,\" \"Development,\" \"Entity of a public nature,\" and \"ICT.\" These definitions clarify the scope and application of the Act's provisions.",
      "rawText": "## 33. In this Act unless the context otherwise requires-\n\n' Board '  means  the  governing body of the  Kofi Annan  Research and Development Centre.\n\n' Centre '  means  the Kofi Annan Centre of Excellence in ICT.\n\n\"Development\" means  the  process  of  designing,  improving,  testing,  or  deploying  ICT  as defined,  based  systems,  platforms,  applications,  or  services,  with  the  aim  of  achieving technological,  educational,  social,  or  economic  advancement,  and  includes  activities  that support the practical application or scaling of research and innovation outcomes.\n\n'Entity of a public nature\" means any body corporate or unincorporated that meets all of the following criteria:\n\n  - (i) Public  Function:  The  entity  performs  functions  that  are  governmental,  statutory, regulatory,  or  are  otherwise  in  furtherance  of  a  public  mandate  or  public  interest objective;\n\n  - (ii) Public Control or Oversight: The entity is subject to significant control, supervision, or oversight  by  a  public  authority,  including  the  Government  of  Ghana  or  any  of  its agencies;\n\n  - (iii) Public Funding Dependency: The entity derives a substantial portion of its funding, whether directly or indirectly, from public sources or from funds administered for public purposes;\n\n  - (iv) Non-Profit Distribution Constraint: The entity does not operate primarily for profit and is restricted from distributing profits or surpluses to private individuals or shareholders;\n\n  - (v) Accountability:  The  entity  is  subject  to  public  accountability  mechanisms,  such  as statutory reporting requirements, audits by a public auditor, or obligations under public procurement or financial administration laws.\n\nAn entity shall be deemed not of a public nature if it is privately owned and operated for commercial purposes, and does not satisfy the above criteria.\n\n\"ICT\" means  information  and  communication  technology  which  refers  to  all  technologies, systems, infrastructure, software, and platforms used for the collection, processing, storage,\n\ntransmission and dissemination of digital information and electronic communications. For the purposes of this Act, ICT shall include;\n\n  - (i) digital hardware and software systems;\n\n  - (ii) information systems and digital applications, especially within government operations;\n\n  - (iii) data centres, hosting facilities, electronic and cloud-based infrastructure;\n\n  - (iv) digital innovation platforms, and emerging technologies deployed in the public sector; and\n\n  - (v) associated standards, architecture, and interoperability frameworks.\n\n' Minister' means the Minister responsible for Communication.\n\n' Ministry ' means the Ministry responsible for Communication.\n\n'Public funding' refers to any financial resources, whether in the form of grants, subsidies, investments, loans, or other financial support mechanisms,  allocated, disbursed, or administered, whether by the Government of Ghana or any other party, for the purpose of supporting  research  and  development  in  ICT,  where  the  ultimate  beneficiary  is  the Government of Ghana, any of its ministries, departments, agencies, statutory bodies, or any entity of a public nature.\n\n\"Public institutions\" refer to government-established, owned, or controlled entities that carry out administrative, regulatory, developmental, or service delivery functions on behalf of the state, excluding public academic institutions. This includes ministries, departments, agencies, statutory bodies, public authorities, and other entities created by or under an Act of Parliament to serve public sector objectives, other than education and academic research conducted by public universities or colleges.\n\n\"Research\" means  a  systematic  investigation  or  inquiry,  whether  theoretical  or  applied, conducted for the purpose of discovering new knowledge, validating existing knowledge, or generating solutions within the field of ICT, including data collection, analysis, experimentation, design, and evaluation.",
      "relatedImpacts": []
    }
  ],
  "notebookLMVideo": {
    "url": "",
    "duration": "10:00"
  },
  "deadline": "2025-12-31",
  "submissionMethod": "Email to clerk@parliament.gov.gh",
  "relatedBills": []
}